Конфигурация/Documents/РегистрацияИнформацииОКонфликтеИнтересов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>РегистрацияИнформацииОКонфликтеИнтересов</Name>
			<BasedOn>
				<xr:Item>Catalog.КонфликтыИнтересов</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыИнформацииОКонфликтеИнтересов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонфликтИнтересов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонфликтыИнтересов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СведенияОКлиенте</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СодержаниеКонфликтаИнтересов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Documents/РегистрацияИнформацииОКонфликтеИнтересов/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
КонецПроцедуры
	
#КонецОбласти 

#Область Обработчики_событий_элементов_формы

&НаКлиенте
Процедура КонфликтИнтересовПриИзменении(Элемент)
	
	КонфликтИнтересовПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидИнформацииПриИзменении(Элемент)
	
	УстановитьЗаголовокСодержанияКонфликта(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти 

#Область Служебные_процедуры_и_функции

&НаСервере
Процедура КонфликтИнтересовПриИзмененииНаСервере()

	ИменаРеквизитов = "Организация, СчетДоверительногоУправления, ДатаВозникновения, СвязанноеЛицо";
	РеквизитыКонфликта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.КонфликтИнтересов, ИменаРеквизитов);
	
	ДанныеКонфликтов = Справочники.КонфликтыИнтересов.ПолучитьТаблицуДанныеКонфликтов();
	НоваяСтрока = ДанныеКонфликтов.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, РеквизитыКонфликта);
	НоваяСтрока.КонфликтИнтересов = Объект.КонфликтИнтересов;
	
	Реквизиты = Справочники.КонфликтыИнтересов.ПолучитьРеквизитыКонфликтовИнтересов(ДанныеКонфликтов);
	
	Если Реквизиты.Количество() = 1 Тогда
		ЗаполнитьЗначенияСвойств(Объект, Реквизиты[0], "СведенияОКлиенте, СодержаниеКонфликтаИнтересов");
		Объект.СчетДоверительногоУправления = РеквизитыКонфликта.СчетДоверительногоУправления;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось получить содержание конфликта и сведения о клинете");
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	УстановитьЗаголовокСодержанияКонфликта(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовокСодержанияКонфликта(ЭтаФорма)

	Если ЭтаФорма.Объект.ВидСобытия = ПредопределенноеЗначение("Перечисление.ВидыИнформацииОКонфликтеИнтересов.Прекращение") Тогда
		Заголовок = "Обстоятельства прекращения конфликта";
	Иначе
		Заголовок = "Содержание конфликта интересов";	
	КонецЕсли;
	
	ЭтаФорма.Элементы.СодержаниеКонфликтаИнтересов.Заголовок = Заголовок;

КонецПроцедуры

#КонецОбласти
